In [1]:
# Bibliotecas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
x = pd.read_csv("../data/Forbes_Richest_Atheletes_1990_2020.csv")

x.head()

,S.NO,Name,Nationality,Current Rank,Previous Year Rank,Sport,Year,earnings ($ million)
0,1,Mike Tyson,USA,1,NaN,boxing,1990,28.6
1,2,Buster Douglas,USA,2,NaN,boxing,1990,26.0
2,3,Sugar Ray Leonard,USA,3,NaN,boxing,1990,13.0
3,4,Ayrton Senna,Brazil,4,NaN,auto racing,1990,10.0
4,5,Alain Prost,France,5,NaN,auto racing,1990,9.0

In [3]:
pd.DataFrame(x.dtypes).reset_index()

                  index        0
0                  S.NO    int64
1                  Name   object
2           Nationality   object
3          Current Rank    int64
4    Previous Year Rank   object
5                 Sport   object
6                  Year    int64
7  earnings ($ million)  float64

In [4]:
x.shape

(301, 8)

In [8]:
x.columns[0]

'S.NO'

In [5]:
x[0:50].shape

(50, 8)

In [6]:
df_aux = pd.DataFrame(x["Name"].value_counts(ascending=False).reset_index()[0:50]["Name"])
df_aux.head()

                 Name
0      Michael Jordan
1         Tiger Woods
2         Kobe Bryant
3  Michael Schumacher
4        LeBron James